# Найдите сумму цифр трехзначного числа.

number = int(input('Введите трехнзначное число: ')) # простой арифметический способ как на семнаре
num1 = number // 100
num2 = number // 10 % 10
num3 = number % 10

if 1000 > number > 0:
    print(num1 + num2 + num3)
else:
    print('Ошибка! Необходимо ввести трехзначное число')